GHB2/src/InformationRegisters/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_НастройкиВозможностейЗакрепленияПарковочныхМест</name>
  <attributes>
    <name>РедактированиеДокументаЗакрепления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОбУвольненииСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОПрекращенииДействияПропуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив доступных локаций, для которых указанный сотрудник имеет право редактирования 
// документа "гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации"
// Параметры:
//		Сотрудник - справочник гхб_ФизическиеЛица
//
Функция ВернутьДоступныеЛокацииСотрудникаДляРедактированияДокумента(_Сотрудник) Экспорт
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_Сотрудник) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Локация КАК Локация
		               |ИЗ
		               |	РегистрСведений.гхб_НастройкиВозможностейЗакрепленияПарковочныхМест КАК гхб_НастройкиВозможностейЗакрепленияПарковочныхМест
		               |ГДЕ
		               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Сотрудник = &Сотрудник
		               |	И гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.РедактированиеДокументаЗакрепления";
		
		Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
		
		_Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

// Возвращает массив сотрудников, которые имеет право редактирования 
// документа "гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации" по указанной локации
// Параметры:
//		Локация - справочник гхб_Помещения
//
Функция ВернутьСотрудниковДляРедактированияДокументовПоЛокации(_Локация) Экспорт
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_Локация) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Сотрудник КАК Сотрудник
		               |ИЗ
		               |	РегистрСведений.гхб_НастройкиВозможностейЗакрепленияПарковочныхМест КАК гхб_НастройкиВозможностейЗакрепленияПарковочныхМест
		               |ГДЕ
		               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Локация = &Локация
		               |	И гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.РедактированиеДокументаЗакрепления";
		
		Запрос.УстановитьПараметр("Локация", _Локация);
		
		_Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

// Возвращает массив физических лиц (справочник гхб_ФизическиеЛица), которых нужно уведомлять при увольнении сотрудников,
// для которых закреплены парковки на локациях
//
Функция ВернутьСотрудниковДляУведомленияПриУвольнении(_Локация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.гхб_НастройкиВозможностейЗакрепленияПарковочныхМест КАК гхб_НастройкиВозможностейЗакрепленияПарковочныхМест
	               |ГДЕ
	               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.ПисьмоОбУвольненииСотрудника
	               |	И гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Локация = &Локация";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Возвращает массив физических лиц (справочник гхб_ФизическиеЛица), которых нужно уведомлять при завершении действия пропусков сотрудников,
// для которых закреплены парковки на локациях
//
Функция ВернутьСотрудниковДляУведомленияПриПрекращенииДействияПропуска(_Локация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.гхб_НастройкиВозможностейЗакрепленияПарковочныхМест КАК гхб_НастройкиВозможностейЗакрепленияПарковочныхМест
	               |ГДЕ
	               |	гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.ПисьмоОПрекращенииДействияПропуска
	               |	И гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.Локация = &Локация";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
